sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_gap.c
/****************************************************************************
 * modules/bluetooth/hal/nrf52/ble_gap.c
 *
 *   Copyright 2022 Sony Semiconductor Solutions Corporation
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name of Sony Semiconductor Solutions Corporation nor
 *    the names of its contributors may be used to endorse or promote
 *    products derived from this software without specific prior written
 *    permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/******************************************************************************
 * Include
 *****************************************************************************/

#include <nuttx/config.h>
#include <string.h>
#include <ble/ble_comm.h>
#include <ble/ble_gap.h>
#include "ble_comm_internal.h"
#include "ble_debug.h"
#include "ble_storage_operations.h"

#include <nrf_crypto.h>
#include <nrf_crypto_ecc.h>

/******************************************************************************
 * externs
 *****************************************************************************/
extern int bleConvertErrorCode(uint32_t errCode);

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define ADV_DATA_TYPE_FLAGS_SIZE                    0x02
#define ADV_DATA_TYPE_COMPLETE_16_UUIDS_SIZE        0x03
#define ADV_DATA_TYPE_COMPLETE_32_UUIDS_SIZE        0x05
#define ADV_DATA_TYPE_COMPLETE_128_UUIDS_SIZE       17

#define ADV_DEFAULT_INTERVAL            50
#if NRF_SD_BLE_API_VERSION > 5
#define ADV_DEFAULT_TIMEOUT             18000 // 10ms units
#else
#define ADV_DEFAULT_TIMEOUT             180
#endif

/* Active scan setting.
 *   1 means that execute active scan.
 *   0 means that do not execute active scan.
 */

#define EXECUTE_ACTIVE_SCAN             1

/* Extended advertising data reception setting.
 *   1 means that enable extended advertising data reception.
 *   0 means that disable extended advertising data reception.
 */

#define ENABLE_EXTENDED_ADV_RECV        1

/* Scan interval setting. unit:625usec. */

#define SCAN_INTERVAL                   512

/* Scan reception window size setting. unit:625usec. SCAN_WINDOW < SCAN_INTERVAL.
 * The smaller this value is, the higher the probability of missing
 * advertising data or scan response data is.
 */

#define SCAN_WINDOW                     511

/* Scan timeout setting. unit:10msec.
 * BLE board stops scan automatically after SCAN_TIMEOUT time has elapsed.
 * In this setting, BLE_GAP_SCAN_TIMEOUT_UNLIMITED means that scan does not stop
 * until sd_ble_gap_scan_stop() execution.
 */

#define SCAN_TIMEOUT                    BLE_GAP_SCAN_TIMEOUT_UNLIMITED
#define MIN_SCAN_INTERVAL               0x0004
#define MAX_SCAN_INTERVAL               0x4000
#define MIN_SCAN_WINDOW                 0x0004
#define MAX_SCAN_WINDOW                 0x4000
#define MIN_SCAN_TIMEOUT                0x0000
#define MAX_SCAN_TIMEOUT                0xFFFF

#define IS_INVALID_SCAN_PARAM(interval, window) \
  (((interval) < BLE_GAP_SCAN_INTERVAL_MIN) || \
   ((window) < BLE_GAP_SCAN_WINDOW_MIN))

#define MIN_CONNECTION_INTERVAL         MSEC_TO_UNITS(7.5, UNIT_1_25_MS)
#define MAX_CONNECTION_INTERVAL         MSEC_TO_UNITS(30, UNIT_1_25_MS)
#define SLAVE_LATENCY                   0
#define SUPERVISION_TIMEOUT             MSEC_TO_UNITS(4000, UNIT_10_MS)

/* Connection timeout value. unit : 10msec.
 * After this timeout value has elapsed since sd_ble_gap_connect() API is
 * executed, the connection timeout event occurs.
 */

#define CONNECTION_TIMEOUT              1000

#define IS_INVALID_CONN_PARAM(min, max, slave, timeout) \
  (((min) < BLE_GAP_CP_MIN_CONN_INTVL_MIN) || \
   ((min) > BLE_GAP_CP_MIN_CONN_INTVL_MAX) || \
   ((max) < BLE_GAP_CP_MAX_CONN_INTVL_MIN) || \
   ((max) > BLE_GAP_CP_MAX_CONN_INTVL_MAX) || \
   ((slave) > BLE_GAP_CP_SLAVE_LATENCY_MAX) || \
   ((timeout) < BLE_GAP_CP_CONN_SUP_TIMEOUT_MIN)|| \
   ((timeout) > BLE_GAP_CP_CONN_SUP_TIMEOUT_MAX))

/* Flash handle key name size */
#define FLASH_KEY_NAME_SIZE      4
#define FLASH_KEY_NAME_2         2
#define FLASH_KEY_NAME_3         3
#define BLE_GAP_ADDR_LENGTH_4    4
#define BLE_GAP_ADDR_LENGTH_5    5
#define BLE_KEY_MASK             0x7F

 /******************************************************************************
 * Structre define
 *****************************************************************************/

 /******************************************************************************
 * Function prototype declaration
 *****************************************************************************/
bleGapMem *bleGetGapMem(void);
static int getAddress(BLE_GapAddr *addr);
static int setAddress(BLE_GapAddr *addr);
static int getName(BLE_GapName *name);
static int setName(BLE_GapName *name);
static int setCustomBaseuuid(uint8_t uuid[]);

