sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_gap.c
  ble_gap_adv_params_t params = {0};
  params.interval = advParams->interval;
  params.duration = advParams->duration;
  params.primary_phy = advParams->primary_phy;
  params.secondary_phy = advParams->primary_phy;
  params.p_peer_addr     = NULL;
  params.filter_policy   = BLE_GAP_ADV_FP_ANY;
  if (params.primary_phy == BLE_GAP_PHY_1MBPS) {
    params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
  }
  else {
    params.properties.type = BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED;
  }

  errCode = sd_ble_gap_adv_set_configure(&gapMem.advHandle, &advData, &params);
  if (errCode) {
    BLE_PRT("BLE_GapStartAdv:sd_ble_gap_adv_set_configure fail 0x%x\n", errCode);
    goto end;
  }
  errCode = sd_ble_gap_adv_start(gapMem.advHandle, APP_BLE_CONN_CFG_TAG);
end:
#else
  errCode = NRF_ERROR_NOT_SUPPORTED;
#endif
  ret = bleConvertErrorCode((uint32_t)errCode);

  return ret;
}

int BLE_GapStartAdv(void)
{
  int errCode = BLE_SUCCESS, ret = BLE_SUCCESS;
  ble_gap_adv_params_t advParams = {0};

#if NRF_SD_BLE_API_VERSION > 5
  ble_gap_adv_data_t advData = {0};
  advData.adv_data.p_data = gapMem.gapAdvData;
  advData.adv_data.len    = gapMem.gapAdvLen;

  advParams.primary_phy     = BLE_GAP_PHY_1MBPS;
  advParams.duration        = ADV_DEFAULT_TIMEOUT;
  advParams.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
  advParams.p_peer_addr     = NULL;
  advParams.filter_policy   = BLE_GAP_ADV_FP_ANY;
  advParams.interval        = ADV_DEFAULT_INTERVAL;
  errCode = sd_ble_gap_adv_set_configure(&gapMem.advHandle, &advData, &advParams);
  if (errCode) {
    BLE_PRT("BLE_GapStartAdv:sd_ble_gap_adv_set_configure fail 0x%x\n", errCode);
    goto end;
  }
  errCode = sd_ble_gap_adv_start(gapMem.advHandle, APP_BLE_CONN_CFG_TAG);
end:
#else
  advParams.type = BLE_GAP_ADV_TYPE_ADV_IND;
  advParams.p_peer_addr = NULL;
  advParams.fp = BLE_GAP_ADV_FP_ANY;
  advParams.interval = ADV_DEFAULT_INTERVAL;
  advParams.timeout = ADV_DEFAULT_TIMEOUT;
  errCode = sd_ble_gap_adv_start(&advParams, APP_BLE_CONN_CFG_TAG);
#endif
  ret = bleConvertErrorCode((uint32_t)errCode);

  return ret;
}

int BLE_GapStopAdv(void)
{
  int errCode = BLE_SUCCESS;
#if NRF_SD_BLE_API_VERSION > 5
  // arg is tentative.
  errCode = sd_ble_gap_adv_stop(gapMem.advHandle);
#else
  errCode = sd_ble_gap_adv_stop();
#endif
  return bleConvertErrorCode((uint32_t)errCode);
}

int BLE_GapSetSecParam(BLE_GapSecCfg *param)
{
  int errCode  = 0;
  int ret      = BLE_SUCCESS;
  BLE_GapSecCfgPasskey *pkey = NULL;
  ble_opt_t    bleOpt = {0};

  if((param == NULL) || (param->data == NULL))
    {
      return -EINVAL;
    }
  memset(&bleOpt,0x00,sizeof(bleOpt));
  switch(param->type)
    {
      case SEC_CFG_PASSKEY:
        {
          pkey = (BLE_GapSecCfgPasskey *)param->data;
          bleOpt.gap_opt.passkey.p_passkey = (uint8_t*)(pkey->passkey);
          errCode = sd_ble_opt_set(BLE_GAP_OPT_PASSKEY, &bleOpt);
          ret = bleConvertErrorCode((uint32_t)errCode);
          break;
        }

      default:
        ret = -EINVAL;
        break;
    }
  return ret;
}

int BLE_GapExchangePairingFeature(BLE_GapConnHandle connHandle,
                                  BLE_GapPairingFeature *own,
                                  const BLE_GapPairingFeature *peer)
{
  int ret      = BLE_SUCCESS;
  int errCode  = 0;
  ble_gap_sec_params_t secParams = {0};
  ble_gap_sec_keyset_t keysExchanged = {{0}};
  ble_gap_sec_params_t *p_sec = NULL;
#ifdef CONFIG_NRF52_LESC
  nrf_crypto_ecc_key_pair_generate_context_t ctx;
  nrf_crypto_ecc_public_key_t pubKey;
  size_t pubKey_len = BLE_GAP_LESC_P256_PK_LEN;
#endif
  if(own != NULL) {
    if((own->oob != BLE_GAP_OOB_AUTH_DATA_PRESENT) &&
       (own->oob != BLE_GAP_OOB_AUTH_DATA_NOT_PRESENT)) {
      BLE_PRT("own->oob=%d\n", own->oob);
      return -EINVAL;
    }
    if((own->maxKeySize < own->minKeySize) ||
      (own->maxKeySize > BLE_GAP_MAX_KEY_SIZE) ||
      (own->minKeySize < BLE_GAP_MIN_KEY_SIZE)) {
      BLE_PRT("own->maxKeySize=%d, own->minKeySize=%d\n", own->maxKeySize, own->minKeySize);
      return -EINVAL;
    }

    memset(&secParams,0,sizeof(secParams));
    memset(&keysExchanged,0,sizeof(keysExchanged));

    memset(&gapMem.wrapperBondInfo.ownEncKey,0,sizeof(gapMem.wrapperBondInfo.ownEncKey));
    memset(&gapMem.wrapperBondInfo.ownIdKey,0,sizeof(gapMem.wrapperBondInfo.ownIdKey));
    memset(&gapMem.wrapperBondInfo.peerEncKey,0,sizeof(gapMem.wrapperBondInfo.peerEncKey));
    memset(&gapMem.wrapperBondInfo.peerIdKey,0,sizeof(gapMem.wrapperBondInfo.peerIdKey));

    secParams.oob          = own->oob;
    secParams.io_caps      = own->ioCap;
    secParams.max_key_size = own->maxKeySize;
    secParams.min_key_size = own->minKeySize;
    secParams.mitm         = (own->authReq & BLE_GAP_AUTH_MITM) >> 1;
    secParams.bond         = (own->authReq & BLE_GAP_AUTH_BOND) >> 0;
    secParams.lesc         = own->lesc & peer->lesc;
    p_sec = &secParams;
  }

  secParams.kdist_own.enc = 1;
  secParams.kdist_own.id  = 1;
  secParams.kdist_peer.enc  = 1;
  secParams.kdist_peer.id   = 1;

  keysExchanged.keys_own.p_enc_key   = &gapMem.wrapperBondInfo.ownEncKey;
  keysExchanged.keys_own.p_id_key    = &gapMem.wrapperBondInfo.ownIdKey;
  keysExchanged.keys_own.p_pk        = &gapMem.lescKey.own_pub;
  keysExchanged.keys_peer.p_enc_key  = &gapMem.wrapperBondInfo.peerEncKey;
  keysExchanged.keys_peer.p_id_key   = &gapMem.wrapperBondInfo.peerIdKey;
  keysExchanged.keys_peer.p_pk       = &gapMem.lescKey.peer_pub;

#ifdef CONFIG_NRF52_LESC
  /* In case that both own device and peer device support LE secure connection
   * pairing, generate key pair for the pairing.
   */

  if (g_ble_context.pairing_feature.lesc & peer->lesc)
    {
      nrf_crypto_init();
      nrf_crypto_ecc_key_pair_generate(&ctx,
                                       &g_nrf_crypto_ecc_secp256r1_curve_info,
                                       &gapMem.lescKey.priv,
                                       &pubKey);
      nrf_crypto_ecc_public_key_to_raw(&pubKey,
                                       gapMem.lescKey.own_pub.pk,
                                       &pubKey_len);
      nrf_crypto_ecc_byte_order_invert(&g_nrf_crypto_ecc_secp256r1_curve_info,
                                       gapMem.lescKey.own_pub.pk,
                                       gapMem.lescKey.own_pub.pk,
                                       BLE_GAP_LESC_P256_PK_LEN);
      nrf_crypto_uninit();
    }
#endif

  errCode = sd_ble_gap_sec_params_reply(connHandle, BLE_GAP_SEC_STATUS_SUCCESS, p_sec, &keysExchanged);
  ret = bleConvertErrorCode((uint32_t)errCode);
  memcpy(&gapMem.keySet, &keysExchanged, sizeof(ble_gap_sec_keyset_t));

