sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_gap.c
  // own
  BLE_PRT("ExchangePairing: own id_irk=0x");
  for (int i=0; i<16; i++) {
    BLE_PRT("%02x", gapMem.wrapperBondInfo.ownIdKey.id_info.irk[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("ExchangePairing: own id_addr_type=%d\n", gapMem.wrapperBondInfo.ownIdKey.id_addr_info.addr_type);
  BLE_PRT("ExchangePairing: own id_addr=0x");
  for (int i=0; i<6; i++) {
    BLE_PRT("%02x", gapMem.wrapperBondInfo.ownIdKey.id_addr_info.addr[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("ExchangePairing: own master_id_ediv=%d\n", gapMem.wrapperBondInfo.ownEncKey.master_id.ediv);
  BLE_PRT("ExchangePairing: own master_id_rand=0x");
  for (int i=0; i<8; i++) {
    BLE_PRT("%02x", gapMem.wrapperBondInfo.ownEncKey.master_id.rand[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("ExchangePairing: own enc_info_auth=%d\n", gapMem.wrapperBondInfo.ownEncKey.enc_info.auth);
  if (gapMem.wrapperBondInfo.ownEncKey.enc_info.ltk_len) {
    BLE_PRT("ExchangePairing: own enc_info_ltk=0x");
    for (int i=0; i<gapMem.wrapperBondInfo.ownEncKey.enc_info.ltk_len; i++) {
      BLE_PRT("%02x", gapMem.wrapperBondInfo.ownEncKey.enc_info.ltk[i]);
    }
    BLE_PRT("\n");
  } else {
    BLE_PRT("ExchangePairing: own enc_info_ltk=%d\n", gapMem.wrapperBondInfo.ownEncKey.enc_info.ltk_len);
  }

  // peer
  BLE_PRT("ExchangePairing: peer id_irk=0x");
  for (int i=0; i<16; i++) {
    BLE_PRT("%02x", gapMem.wrapperBondInfo.peerIdKey.id_info.irk[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("ExchangePairing: peer id_addr_type=%d\n", gapMem.wrapperBondInfo.peerIdKey.id_addr_info.addr_type);
  BLE_PRT("ExchangePairing: peer id_addr=0x");
  for (int i=0; i<6; i++) {
    BLE_PRT("%02x", gapMem.wrapperBondInfo.peerIdKey.id_addr_info.addr[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("ExchangePairing: peer master_id_ediv=%d\n", gapMem.wrapperBondInfo.peerEncKey.master_id.ediv);
  BLE_PRT("ExchangePairing: peer master_id_rand=0x");
  for (int i=0; i<8; i++) {
    BLE_PRT("%02x", gapMem.wrapperBondInfo.peerEncKey.master_id.rand[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("ExchangePairing: peer enc_info_auth=%d\n", gapMem.wrapperBondInfo.peerEncKey.enc_info.auth);
  if (gapMem.wrapperBondInfo.peerEncKey.enc_info.ltk_len) {
    BLE_PRT("ExchangePairing: peer enc_info_ltk=0x");
    for (int i=0; i<gapMem.wrapperBondInfo.peerEncKey.enc_info.ltk_len; i++) {
      BLE_PRT("%02x", gapMem.wrapperBondInfo.peerEncKey.enc_info.ltk[i]);
    }
    BLE_PRT("\n");
  } else {
    BLE_PRT("ExchangePairing: peer enc_info_ltk=%d\n", gapMem.wrapperBondInfo.peerEncKey.enc_info.ltk_len);
  }

  return ret;
}

#if NRF_SD_BLE_API_VERSION > 5
static int8_t ble_gap_scan_tx_power = 0;
uint8_t bleAdvReportBuffer[BLE_GAP_SCAN_BUFFER_EXTENDED_MIN];
#endif

int BLE_GapSetScanCompatMode(bool enable)
{
  int ret     = BLE_SUCCESS;
  int errCode = 0;
  ble_opt_t opt;

  memset(&opt, 0x0, sizeof(opt));
  opt.gap_opt.compat_mode_1.enable = enable ? 1 : 0;

  errCode = sd_ble_opt_set(BLE_GAP_OPT_COMPAT_MODE_1, &opt);
  ret = bleConvertErrorCode((uint32_t)errCode);

  return ret;
}

int BLE_GapSetScanParam(struct ble_scan_param_s *scanParam)
{
  if(scanParam == NULL) {
    return -EINVAL;
  }
  if (IS_INVALID_SCAN_PARAM(scanParam->interval,
                            scanParam->window)) {
    return -EINVAL;
  }

  gapMem.scanParams.active   = scanParam->active;
  gapMem.scanParams.interval = scanParam->interval;
  gapMem.scanParams.window   = scanParam->window;
  gapMem.scanParams.timeout  = scanParam->timeout;

  return 0;
}

int BLE_GapStartScan(void)
{
  int ret      = BLE_SUCCESS;
  int errCode  = 0;

  if (IS_INVALID_SCAN_PARAM(gapMem.scanParams.interval,
                            gapMem.scanParams.window)) {
    /* If scan parameter is not set, use the default value. */

    gapMem.scanParams.active   = EXECUTE_ACTIVE_SCAN;
    gapMem.scanParams.interval = SCAN_INTERVAL;
    gapMem.scanParams.window   = SCAN_WINDOW;
    gapMem.scanParams.timeout  = SCAN_TIMEOUT;
  }

#ifdef CONFIG_NRF52_SCAN_COMPAT_MODE
  /* Allow connection to legacy peripheral device that do not support
   * a Window offset parameter of 0.
   */

  BLE_GapSetScanCompatMode(true);
#endif

#if NRF_SD_BLE_API_VERSION > 5
  /* Always use the fixed value. */

  gapMem.scanParams.filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL;
  gapMem.scanParams.scan_phys     = BLE_GAP_PHY_1MBPS;
  gapMem.scanParams.extended      = ENABLE_EXTENDED_ADV_RECV;

  ble_gap_scan_tx_power           = gapMem.txPower;
  errCode = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_SCAN_INIT, 0,
    ble_gap_scan_tx_power);
  if (errCode) {
    BLE_PRT("sd_ble_gap_tx_power_set fail 0x%x\n", errCode);
    goto end;
  }

  ble_data_t reportBuf = {0};
  reportBuf.p_data = bleAdvReportBuffer;
  reportBuf.len = BLE_GAP_SCAN_BUFFER_EXTENDED_MIN;
  errCode = sd_ble_gap_scan_start(&gapMem.scanParams, &reportBuf);
end:
#else
  errCode = sd_ble_gap_scan_start(&gapMem.scanParams);
#endif
  ret = bleConvertErrorCode((uint32_t)errCode);
  return ret;
}

int BLE_GapStartScanExt(BLE_GapScanParams *scanparams)
{
  int ret      = BLE_SUCCESS;
  int errCode  = 0;

  if(scanparams == NULL) {
    return -EINVAL;
  }

  ble_gap_scan_params_t p = {0};
  p.active       = scanparams->active;
  p.interval     = scanparams->interval;
  p.window       = scanparams->window;
  p.timeout      = scanparams->timeout;
#if NRF_SD_BLE_API_VERSION > 5
  p.filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL;
  p.scan_phys     = scanparams->scan_phys;
  if (p.scan_phys == BLE_GAP_PHY_CODED) {
    p.extended    = 1;
  }
  gapMem.scanParams = p;

  ble_gap_scan_tx_power = scanparams->tx_power;
  errCode = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_SCAN_INIT, 0,
    ble_gap_scan_tx_power);
  if (errCode) {
    BLE_PRT("sd_ble_gap_tx_power_set fail 0x%x\n", errCode);
    goto end;
  }

  ble_data_t reportBuf = {0};
  reportBuf.p_data = bleAdvReportBuffer;
  reportBuf.len = BLE_GAP_SCAN_BUFFER_EXTENDED_MIN;
  errCode = sd_ble_gap_scan_start(&gapMem.scanParams, &reportBuf);
end:
#else
  gapMem.scanParams = p;
  errCode = sd_ble_gap_scan_start(&gapMem.scanParams);
#endif
  ret = bleConvertErrorCode((uint32_t)errCode);
  return ret;
}

