sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_gap.c
int BLE_GapStopScan(void)
{
  int ret      = BLE_SUCCESS;
  int errCode  = 0;

  errCode = sd_ble_gap_scan_stop();
  ret = bleConvertErrorCode((uint32_t)errCode);
  return ret;
}

int BLE_GapSetConnectionParams(BLE_GapConnParams *connParams)
{
  int ret = BLE_SUCCESS;

  if (connParams == NULL) {
      return -EINVAL;
  }

  if (IS_INVALID_CONN_PARAM(connParams->minConnInterval,
                            connParams->maxConnInterval,
                            connParams->slaveLatency,
                            connParams->connSupTimeout)) {
      return -EINVAL;
  }

  gapMem.connParams.min_conn_interval = connParams->minConnInterval;
  gapMem.connParams.max_conn_interval = connParams->maxConnInterval;
  gapMem.connParams.slave_latency     = connParams->slaveLatency;
  gapMem.connParams.conn_sup_timeout  = connParams->connSupTimeout;

  return ret;
}

int BLE_GapConnect(BLE_GapAddr *addr)
{
  int ret      = BLE_SUCCESS;
  int errCode  = 0;
  ble_gap_addr_t peerAddr = {0};
  ble_gap_scan_params_t scanParams;

  if(addr == NULL) {
    return -EINVAL;
  }

  /* The timeout of scan parameters is used as the connection timeout
   * in BLE board.
   * Because the timeout value is set to 'infinitely'(timeout does not occur)
   * in scan start timing, connection timeout setting is also 'infinitely'
   * without change.
   * So, modify this timeout value to finite value to avoid that
   * application wait connection infinitely.
   */

  memcpy(&scanParams, &gapMem.scanParams, sizeof(scanParams));
  scanParams.timeout = CONNECTION_TIMEOUT;

  if (IS_INVALID_CONN_PARAM(gapMem.connParams.min_conn_interval,
                            gapMem.connParams.max_conn_interval,
                            gapMem.connParams.slave_latency,
                            gapMem.connParams.conn_sup_timeout)) {
    /* If connection parameter is not set, use the default value. */

    gapMem.connParams.min_conn_interval = MIN_CONNECTION_INTERVAL;
    gapMem.connParams.max_conn_interval = MAX_CONNECTION_INTERVAL;
    gapMem.connParams.slave_latency     = SLAVE_LATENCY;
    gapMem.connParams.conn_sup_timeout  = SUPERVISION_TIMEOUT;
  }

  peerAddr.addr_type = addr->type;
  memcpy(peerAddr.addr, addr->addr, BLE_GAP_ADDR_LENGTH);
  errCode = sd_ble_gap_connect(&peerAddr,
                  &scanParams,
                  &gapMem.connParams,
                  APP_BLE_CONN_CFG_TAG);
  ret = bleConvertErrorCode((uint32_t)errCode);
  return ret;
}

int BLE_GapUpdateConnectionParams(BLE_GapConnHandle connHandle, BLE_GapConnParams *connParams)
{
  int ret      = BLE_SUCCESS;
  int errCode  = 0;

  if(connParams == NULL)
    {
      return -EINVAL;
    }

  gapMem.connParams = *(ble_gap_conn_params_t *)connParams;
  errCode = sd_ble_gap_conn_param_update(connHandle, &gapMem.connParams);
  ret = bleConvertErrorCode((uint32_t)errCode);
  return ret;
}

int BLE_GapCancelConnecting(void)
{
  int ret      = BLE_SUCCESS;
  int errCode  = 0;

  errCode = sd_ble_gap_connect_cancel();
  ret = bleConvertErrorCode((uint32_t)errCode);
  return ret;
}

int BLE_GapDisconnectLink(BLE_GapConnHandle connHandle)
{
  int errCode = sd_ble_gap_disconnect((uint16_t)connHandle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
  return bleConvertErrorCode((uint32_t)errCode);
}

int BLE_GapAuthenticate(BLE_GapConnHandle connHandle, BLE_GapPairingFeature *pairingFeature)
{
  int ret      = BLE_SUCCESS;
  int errCode  = 0;
  ble_gap_sec_params_t secParams = {0};

  if(pairingFeature == NULL) {
    return -EINVAL;
  }

  secParams.oob          = pairingFeature->oob;
  secParams.io_caps      = pairingFeature->ioCap;
  secParams.max_key_size = pairingFeature->maxKeySize;
  secParams.min_key_size = pairingFeature->minKeySize;
  secParams.mitm         = (pairingFeature->authReq & BLE_GAP_AUTH_MITM) >> 1;
  secParams.bond         = (pairingFeature->authReq & BLE_GAP_AUTH_BOND) >> 0;
  secParams.kdist_own.enc   = 1;
  secParams.kdist_own.id    = 1;
  secParams.kdist_peer.enc  = 1;
  secParams.kdist_peer.id   = 1;
  secParams.lesc = pairingFeature->lesc;

  errCode = sd_ble_gap_authenticate(connHandle, &secParams);
  ret = bleConvertErrorCode((uint32_t)errCode);
  return ret;
}

int BLE_GapReplyPairingFeature(BLE_GapConnHandle connHandle)
{
  int ret      = BLE_SUCCESS;
  int errCode  = 0;
  ble_gap_sec_keyset_t secKeyset = {{0}};

  secKeyset.keys_peer.p_enc_key   = &gapMem.wrapperBondInfo.peerEncKey;
  secKeyset.keys_peer.p_id_key    = &gapMem.wrapperBondInfo.peerIdKey;

  errCode = sd_ble_gap_sec_params_reply(connHandle, BLE_GAP_SEC_STATUS_SUCCESS, NULL, &secKeyset);
  ret = bleConvertErrorCode((uint32_t)errCode);
  memcpy(&gapMem.keySet, &secKeyset, sizeof(ble_gap_sec_keyset_t));
  return ret;
}


int BLE_GapReplyAuthKey(BLE_GapAuthKey *authKey)
{
  int ret      = BLE_SUCCESS;
  int errCode  = 0;

  if((authKey == NULL) || (authKey->key == NULL)) {
    return -EINVAL;
  }

  errCode = sd_ble_gap_auth_key_reply(authKey->handle, authKey->keyType, authKey->key);
  ret = bleConvertErrorCode((uint32_t)errCode);
  return ret;
}

int BLE_GapSaveBondInfo(BLE_GapBondInfo *info)
{
  int ret = 0;
  int index;
  BLE_GapBondInfo checkInfo={0};
  
  if (info == NULL)
    {
      return -EINVAL;
    }

  if ((gapMem.wrapperBondInfo.bondInfo.addrType != info->addrType) ||
    memcmp(gapMem.wrapperBondInfo.bondInfo.addr, info->addr, BLE_GAP_ADDR_LENGTH) ||
    !memcmp(checkInfo.addr, info->addr, BLE_GAP_ADDR_LENGTH))
    {
      ret = -EINVAL;
      BLE_PRT("BLE_GapSaveBondInfo: Not finished Authenticate %d\n", ret);
      return ret;
    }
  uint32_t list = bleBondEnableList;
  if (bleBondEnableList == 0xFF)
    {
      ret = -ENOMEM;
      BLE_PRT("BLE_GapSaveBondInfo: BondInfo full %d\n", ret);
      return ret;
    }
  if(bleBondEnableList) {
    for(index = 0; index < BLE_SAVE_BOND_DEVICE_MAX_NUM; index++, list >>= 1) {
      if (!(list & 1)) {
        continue;
      }
      if(!memcmp(BondInfoInFlash[index].bondInfo.addr, info->addr, BLE_GAP_ADDR_LENGTH)) {
        BLE_PRT("BLE_GapSaveBondInfo: Exsiting addr\n");
        BondInfoInFlash[index] = gapMem.wrapperBondInfo;
        goto save;
      }
    }
  }
  list = bleBondEnableList;
  for(index = 0; index < BLE_SAVE_BOND_DEVICE_MAX_NUM; index++, list >>= 1) {
    if (list & 1) {
      continue;
    }
    BondInfoInFlash[index] = gapMem.wrapperBondInfo;
    bleBondEnableList |= (1 << index);
    break;
  }
  BLE_PRT("BLE_GapSaveBondInfo: bleBondEnableList 0x%lx\n", bleBondEnableList);
  if (index == BLE_SAVE_BOND_DEVICE_MAX_NUM) {
    ret = -ENOMEM;
    BLE_PRT("BLE_GapSaveBondInfo: BondInfo full ?? %d\n", ret);
    return ret;
  }
save:
  ret = BSO_SetRegistryValue(bleKey.info_key[index],
    (const void*)&BondInfoInFlash[index], sizeof(bleGapWrapperBondInfo));
  if(0 != ret) {
    BLE_PRT("BLE_GapSaveBondInfo: Set info_key NG %d size %d\n", ret, sizeof(bleGapWrapperBondInfo));
    return ret;
  }
  ret = BSO_SetRegistryValue(bleKey.enable_key, (const void*)&bleBondEnableList, sizeof(uint32_t));
  if(0 != ret) {
    BLE_PRT("BLE_GapSaveBondInfo: Set enable_key NG %d\n", ret);
    return ret;
  }
  BSO_Sync();
  return 0;
}

int BLE_GapClearBondInfo(BLE_GapBondInfo *info)
{
  int ret = BLE_SUCCESS;
  int index;
  uint32_t list = bleBondEnableList;

  if (info == NULL)
    {
      return -EINVAL;
    }
  if (!bleBondEnableList)
    {
      ret = -ENOENT;
      BLE_PRT("BLE_GapClearBondInfo: BondInfo empty %d\n", ret);
      return ret;
    }

  for(index = 0; index < BLE_SAVE_BOND_DEVICE_MAX_NUM; index++, list >>= 1) {
    if (!(list & 1)) {
      continue;
    }
    if(!memcmp(BondInfoInFlash[index].bondInfo.addr, info->addr, BLE_GAP_ADDR_LENGTH)) {
      bleBondEnableList &= ~(1 << index);
      break;
    }
    BLE_PRT("BLE_GapClearBondInfo: Type:%d Addr[%d]:%02X:%02X:%02X:%02X:%02X:%02X\n",
      BondInfoInFlash[index].bondInfo.addrType,
      index,
      BondInfoInFlash[index].bondInfo.addr[5],
      BondInfoInFlash[index].bondInfo.addr[4],
      BondInfoInFlash[index].bondInfo.addr[3],
      BondInfoInFlash[index].bondInfo.addr[2],
      BondInfoInFlash[index].bondInfo.addr[1],
      BondInfoInFlash[index].bondInfo.addr[0]);
  }
  BLE_PRT("BLE_GapClearBondInfo: new bleBondEnableList 0x%lx\n", bleBondEnableList);
  if (index == BLE_SAVE_BOND_DEVICE_MAX_NUM) {
    ret = -ENOENT;
    BLE_PRT("BLE_GapSaveBondInfo: Not entry %d\n", ret);
    return ret;
  }
  //BLE_PRT("BLE_GapClearBondInfo: enable_key 0x%x\n", bleKey.enable_key);
  ret = BSO_SetRegistryValue(bleKey.enable_key, (const void*)&bleBondEnableList, sizeof(uint32_t));
  if(0 != ret) {
    BLE_PRT("BLE_GapClearBondInfo: Set enable_key index %d NG %d\n", index, ret);
    return ret;
  }
  BSO_Sync();
  return ret;
}

